# -*- coding: utf-8 -*-

# RUSSIAN

"""
Jokes from:
    https://anekdoty.ru/pro-programmistov/
    https://techrocks.ru/2018/11/28/programmers-jokes-about-themselves/
//
Шутки взяты из:
    https://anekdoty.ru/pro-programmistov/
    https://techrocks.ru/2018/11/28/programmers-jokes-about-themselves/
"""

neutral = [
    "Жил-был программист и было у него два сына - Антон и Неантон.",
    "Если бы программисты были врачами, им бы говорили «У меня болит нога», а они отвечали «Ну не знаю, у меня такая же нога, а ничего не болит».",
    "Работа программиста и шамана имеет много общего - оба бормочут непонятные слова, совершают непонятные действия и не могут объяснить, как оно работает.",
    "По радио сообщили о переходе на зимнее время, сказав, что «этой ночью, ровно в 03:00 нужно перевести стрелку часов на один час назад, на 02:00». У всех программистов эта ночь зависла в бесконечном цикле.",
    "Программа получилась плохой, а сроки горят, и заказчик ругается? Не волнуйтесь, смело выпускайте релиз. Просто назовите его версией 1.0.",
    "Если вы посмотрите на код, который вы писали более полугода назад, то, скорей всего, вам покажется, что автор – кто-то другой.",
    "Существует два вида языков программирования: одни – все ругают, другими не пользуются.",
    "Пока компьютеры не умеют мыслить самостоятельно, им можно доверять.",
    "Самое главное отличие C от C++: на Си вы можете делать ошибки, а в C++ — еще и наследовать их.",
    "Современное программное обеспечение напоминает египетские пирамиды. Миллионы блоков как-то стоят друг на друге без какой-то целостности конструкции, но с помощью каторжного труда тысяч рабов.",
    "Современное программирование похоже на бег наперегонки со Вселенной: программисты стараются сделать код, рассчитанный на любого идиота, Вселенная плодит новые разновидности идиотов. Пока что Вселенная побеждает всухую.",
    "Есть 10 типов людей: понимающие двоичную систему счисления и не понимающих.",
    "Ложась спать программист ставит рядом на столик 2 стакана. Один с водой - если захочет пить, второй пустой - если не захочет.",
    "Приходит программист к пианисту - посмотpеть на новый pояль. Долго ходит вокpyг, хмыкает, потом заявляет: - Клава неyдобная - всего 84 клавиши, половина фyнкциональных, ни одна не подписана, хотя… шифт нажимать ногой - оpигинально.",
]


"""
All the jokes about Chuck grubbed from https://habr.com/ru/post/69384/
//
Все шутки про Чака взяты из https://habr.com/ru/post/69384/
"""

chuck = [
    "Все массивы Чак Норрис объявляет бесконечными, потому что Чак Норрис не знает границ.",
    "Чак Норрис пишет код который оптимизирует себя сам..",
    "Чак Норрис не может тестировать на равенство потому что он не имеет себе равных.",
    "Первая программа Чака Норриса была kill -9.",
    "MySpace на самом деле это не ваше пространство 'space', это пространство Чака (просто он дает вам пользоваться им).",
    "Чак Норрис может написать функцию бесконечной рекурсии и получить ее результат.",
    "Чак Норрис может решить задачу Башен Ханоя за один ход.",
    "Чак Норрис прошел до конца World of Warcraft.",
    "«У меня это работает» всегда справедливо для Чака Норриса.",
    "Чак Норрис может удалить Корзину.",
    "Борода Чака Норриса может печатать 140 слов в минуту.",
    "Чак Норрис может тестировать все приложение всего одним ассертом (одной проверкой).",
    "У клавиатуры Чака нет клавишы Ctrl потому что ничто его не может контролировать..",
    "Когда Чак Норрис заходит на вебсайты они получают предупреждение «Внимание: Internet Explorer считает этого пользователя вредоносным или опасным. Продолжить?».",
    "Чак Норрис может делить на 0.",
    "На клавиатуре Чака всего две клавиши 0 и 1.",
    "Чаку Норрису не нужно sudo он просто печатает свое имя перед командами.",
    "Чаку Норрису не нужен дебаггер, одного его взгляда на баг хватает чтобы код заработал верно.",
    "Чак Норрис может создавать объекты из интерфейсов.",
    "Класс Object наследуется от Чака Норриса.",
    "Чак Норрис знает последнюю цифру числа Пи.",
    "Чак Норрис не получает ошибок компилятора, язык программирования сам изменяется чтобы приспособиться к Чаку.",
    "Чак Норрис не верит в дробные числа потому что на его клавиатуре только две клавиши 0 и 1.",
    "Ничто не может перехватить исключение Чака Норриса ChuckNorrisException.",
    "Чак Норрис может писать многопоточные программы в одном потоке.",
    "На клавиатуре Чака нет клавишы Escape потому что никто не может спастить от Чака Норриса.",
    "Чак Норрис может наследовать final-класс.",
    "Чаку не нужно знать пароль чтобы зайти в вашу систему, он просто набирает ***** и получает доступ.",
    "Если Чак Норрис пишет код с багами, баги чинят себя сами.",
    "Аптайм хостинга Чака Норриса — 101%.",
    "Чак Норрис может установить iTunes без Quicktime.",
    "Чаку Норрису для работы не нужна операционная система.",
    "Чак Норрис может получать доступ к приватным переменным объекта.",
]

jokes_ru = {
    "neutral": neutral,
    "chuck": chuck,
    "all": neutral + chuck,
}
