# -*- coding: utf-8 -*-

# CHINESE (SIMPLIFIED)

"""
精简笑话; Short and simple jokes
Source: https://gist.github.com/baymaxium/ee621a2f66a32485f5e3823e7bba0d34
        https://cloud.tencent.com/developer/article/1082283
        https://cloud.tencent.com/developer/article/1063629?policyId=1003
        https://www.python.org/doc/humor/
"""

neutral = [
    "人生苦短, 我用Python。",
    "// 无评论。",
    "/* 无评论。*/",
    "洛阳亲友如相问，就说我在敲代码。",
    "程序员经常熬夜有三个弊端：第一，记忆力越来越差；第二，数数经常会数错；第四，记忆力越来越差。",
    "问: 如何生成一个随机的字符串？答: 让新手退出VIM。",
    "普通青年用IDE; 文艺青年用VIM、Emacs; 二逼青年将IDE设置成VIM模式。",
    "一名程序员的吐槽：即要被当做修电脑的，也要被当作做网站的；即要被当作杀毒的，也要被当作盗号的。我要告诉大家，其实我们只是写代码的。",
    "同事说, 他在写i++的时候总觉的自己写的是我艹。",
    "宪法算个球！中国的法律都是.txt文件, 不是.exe文件。",
    "生活不仅只是敲代码, 还有...调bug。",
    '“我爱你”三个字, 说出来只要三秒钟, 解释要三小时, 证明却要一辈子。“bug”三个字母, 发现需要三秒, 找到需要三小时, debug却要一辈子。',
    "错误原因：找不到程序集 “老婆.dll” 。重新安装 “房子.exe”、“车子.exe”,可能会解决此问题。",
    "程序员要了3个孩子,分别取名叫Ctrl、Alt和Delete。如果他们不听话,程序员就只要同时敲他们一下就会好的。",
    "我真的想让这个世界变得更好，但是他们不给我源代码...",
    '一个人正吸着烟，吐着烟圈。朋友生气了劝道，“你没看见包装盒上的警告么?吸烟有害健康!” 那人回答：“我是程序员。我们不在意警告，只关心错误。”',
    "杀一个程序员不需要用枪，改三次需求就可以了。",
    "有时候真觉得有些事情如同char*一般，从开始就注定，无法改变。",
    "IT工程师=加班狂+程序员+测试工程师+实施工程师+网络工程师+电工+装卸工+搬运工+超人",
    "生活中程序员的真实写照、一款游戏一包烟，一台电脑一下午。一盒泡面一壶茶，一顿能管一整天。",
    "大家一起玩的时候有个朋友总是制造尴尬场面,于是默默在心里给了一个 pop.",
    "假如生活欺骗了你，不要悲伤不要心急。《代码大全》会一直陪伴着你...",
    "前端工程师说,我去交友网站找女朋友去了。朋友问找到了么,工程师说,找到了他们页面的一个bug...",
    "程序写得好，老板天天找，程序写得好，周末木有了，程序写得好，随时外地跑，程序写的好，找你修电脑。",
    "问：什么比七个工作日更让人不爽？答：第八个(debug)。",
    "你愿意尊重她，帮助她，关怀她，爱她一生一世吗？”，被问到这个问题的时候，程序员新郎有点慌，因为这个场景太熟悉了，又是需求还没明确好就把排期给定好了。",
    "问: Python 的尽头是什么？答：是 import 一个能写代码的 AI。",
    "程序员 A: “我离高效编程只差一个空格。”  程序员 B: “那是 IndentationError （缩进错误）。”"
]


"""
Longer jokes for build-up and delivery
"""

longer = [
"""
程序员最痛苦的事儿是啥，知道不？就是，程序没做完，需求又改了;
程序员最最痛苦的事儿是啥，知道不？就是，系统好不容易做完了，方案全改了； 
程序员最最最痛苦的事儿是啥，知道不？就是，系统做完了，狗日的客户跑了； 
程序员最最最最痛苦的事儿是啥，知道不？就是，狗日的客户又回来了,程序给删没了！
""",
"""
问：如何区分老程序员和新手？
答：老程序员在 Python 3 里写 print "Hello"，然后盯着报错发呆。
""",
"""
十年前，女：“对不起，我不会喜欢你的，你不要再坚持了，就好比让 Linux 和 Windows 同时运行在一台PC机上, 可能吗？”
男生听后默默转身离开。
十年后，在一次技术大会上，我听到一名虚拟技术开发程序员给我讲述了这个故事。
""",
"""
【世界上最没用的几句话】
1、警察:不要跑! 2、国足: 必胜! 3、老师: 同学们不要睡了!
4、病人: 医生, 您轻点儿! 5、父母: 孩子, 不要闹了!
6、罪犯: 我是冤枉啊! 7、程序员: 这个不能实现。
""",
"""
问：换一个电灯泡需要几个微软程序员？
答：一个也不要，他们会把黑暗变成标准然后告诉每个人：“我们就是这么设计的。” 
""",
"""
面试官: “为什么你不做上一份工作了? ”
WEB程序员: “我开发的网站自从上线后，始终没有出现过任何问题。”
“不错呀，然后呢？” “然后我就被公司辞退了。”
""",
"""
早晨,一女生抱着一堆书进了阅览室，结果警报响了。管理员大妈让女生看看是哪本书把警报弄响了，那女生把书倒出来，准备一本一本的测。
大妈见状急了，把书分成两份，第一份过了一下，响了。
又把这一份分成两份接着测,三回就找到了。大妈用鄙视的眼神看着女生,仿佛在说O(n)和O(log2n)都分不清。
""",
"""
一程序员家的水管坏了,他打电话叫来一个水管工修理。水管工鼓捣了一个小时,终于把管子修好了,他递给程序员一张600元的帐单。
“600元!”程序员愤怒地说：“我当程序员一天都赚不了这么多钱！”
“是啊。”水管工平静地说，“我当程序员的时候也是。”
""",
"""
本人擅长Ai、Br、Ae、Pr、Id、Ps等软件的安装与卸载,精通CSS、JavaScript、PHP、C、C++、C#、Java、Ruby、Perl、Lisp、Python等单词的拼写,
熟悉Windows、Linux、MacOS、IOS、Android等系统的开关机,求一份月薪上万的工作!
""",
"""
对于各种凌乱的电脑问题，其他行业的人，以为程序员们什么都会；
程序员中的女程序员，以为男程序员什么都会；
男程序员中一般程序员，以为技术好的程序员什么都会；
技术好的程序员每次都在网上苦苦找答案。
""",
"""
一个士兵爱上一个公主,公主告诉他,如果他愿意连续100个晚上守在她的阳台下,她就接受他。
于是士兵照做了，他等了一天，两天，三天...直到第九十九天，士兵离开了。
"""
]


jokes_cn = {
    "neutral": neutral,
    "longer": longer,
    "all": neutral + longer,
}
