# -*- coding: utf-8 -*-

neutral = [
    'Я змінив би світ! .. та Господь не надає вихідних кодів...',
    'Для догляду за літнім програмістом потрібна приємна жінка, що говорить на JАVА, LІSР і С++.',
    '— Доброго дня, Катю можна? — Вона в архіві. — Розархівуйте її, будь ласка. Вона мені терміново потрібна.',
    '— Програміст — це людина, яка спочатку довго думає, щоб потім нічого не робити.',
    '>: (: смайл Шрьодінґера: водночас і веселий і сумний.',
    'Коли комп’ютери були великими — програми були маленькими.',
    'Знання асемблера не звільняє від пересічності...',
    'Робізрав клатіватуру, почитсив і збірва назда.',
    'Швидкісний Інтернет – це коли файл простіше знову витягнути, ніж знайти його на жорсткому дискові.',
    'Бабусю! Ну скільки разів вам казати — я не нахер! Я хакер!!!',
    'Із комбінації лінощів і логіки виходять програмісти.',
    'Кепський той Еrrоr, що не мріє стати Fаtаl’ом.',
    'Програміст — компіляція ліні та логіки.',
    'Про людину можна судити по її Теmроrаry Іntеrnеt Fіlеs...',
    'Напис на моніторі "виконано 99%" тішить тільки перші три години...',
    'Нікого робота програми не дивує так часто, як її творця!',
    'Заблудився хакер у лісі. І давай кричати: F1, F1, F1!!!',
    'Знаєте, чому кішки люблять програмістів? - Тому що їх руки пахнуть мишками!'
]

jokes_gl = {
    'neutral': neutral,
    'all': neutral,
}
